<a href="https://codeimmersives.com"><img src = "https://www.codeimmersives.com/wp-content/uploads/2019/09/CodeImmersives_Logo_RGB_NYC_BW.png" width = 400> </a>


<h1 align=center><font size = 5>Agenda</font></h1>

### 
<div class="alert alert-block alert-info" style="margin-top: 20px">

1.  [Review](#0)<br>
2.  [Pandas continued](#2)<br>
2.  [Exercise](#10)<br> 
3.  [Exercise](#12)<br>     
</div>
<hr>

<h2>Review</h2>

<h2>Pandas Series continued</h2>

We can sort a series by using the sort_values method.<br>
<code>
import pandas as pd
x = [27,4,14,23,33,14,22,11]
ps = pd.Series(x).sort_values(ascending = False)
ps
</code><br>
NOTE: We can use the ascending = True to sort the series in ascending order

In [1]:
import pandas as pd
x = [27,4,14,23,33,14,22,11] 
ps = pd.Series(x).sort_values(ascending = False) 
ps

4    33
0    27
3    23
6    22
2    14
5    14
7    11
1     4
dtype: int64

We can also sort a series using a lambda expression.  Consider the <br>
following list of strings:<br>
<code>
ps = pd.Series(['a', 'B', 'c', 'D', 'e'])
ps.sort_values(key=lambda x: x.str.lower())
ps
</code><br>
NOTE: We can use the str method to change all values in a series to a string

In [2]:
ps = pd.Series(['a', 'c', 'B', 'd', 'e'])
ps_sorted = ps.sort_values(key=lambda x: x.str.upper())
ps_sorted

0    a
2    B
1    c
3    d
4    e
dtype: object

<H2>Exercise</h2>
Take the following list of cities and alphabetize them and put them<br>
In the proper case:  ALBANY ---> Albany<br>
<case>
cities = ['PROVIDENCE', 'HARTFORD','BOSTON','ALBANY','TRENTON']

</case>

<h4>Solution</h4>

In [43]:
cities2 = ['PROVIDENCE', 'HARTFORD','BOSTON','ALBANY','TRENTON']

In [44]:
# Long way of doiing this problem

# Convert to series
s = pd.Series(cities2)

# Sort the values
s_sorted = s.sort_values()

# Convert to lower case
s_alpha = [x[0] + x[1:].lower() for x in s_sorted]

s_alpha

['Albany', 'Boston', 'Hartford', 'Providence', 'Trenton']

In [45]:

ps = pd.Series(cities2).sort_values(key=lambda x: x.str.upper())
ps_sorted = [cities2[1:].lower() for cities2 in cities2]
ps_sorted

['rovidence', 'artford', 'oston', 'lbany', 'renton']

In [46]:
# Create a Pandas Series from the list of cities
cities_series = pd.Series(cities2)

# Sort the cities in alphabetical order
cities_sorted = cities_series.sort_values()

# Convert the cities to proper case
cities_proper_case = cities_sorted.str.capitalize()

cities_proper_case

3        Albany
2        Boston
1      Hartford
0    Providence
4       Trenton
dtype: object

In [47]:
# Pandas Series from list of cities in alphabetical order and first letter capitolized
cities_series = pd.Series(cities2).sort_values().str.capitalize()

cities_series

3        Albany
2        Boston
1      Hartford
0    Providence
4       Trenton
dtype: object

<h4>Pandas Series.str methods</h4>
Here is a list of str methods to try:<br>
str.contains<br>
str.count<br>
str.endswith<br>
str.find<br>
str.index<br>
str.join<br>
str.get<br>
str.len<br>
str.split<br>
str.isalnum<br>

<h2> Exercise </h2> 
1) use pd.str to get a boolean matrix for which words in the series <code> ['Mouse', 'dog', 'house and parrot', '23', np.NaN] </code> contain 'og' - use pd.str.contains <br>
2) Use pd.str.count to get the count of 'a' in the series <code> ['A', 'B', 'Aaba', 'Baca', np.nan, 'CABA', 'cat','aardvark'] </code> <br>
3) Use pd.str.count to get the count of dollar signs in the series *hint* special characters need a double backslash before them ('\\') <code>
['$', 'B', 'Aab$', '$$ca', 'C$B$', 'cat', 'canna$', 'findme_', 'dollarsign$', 'infinite', 'lo$'] </code>
 <br>
4) Use pd.str.endswith() to see how many strings end with 't' in the series <code> ['bat', 'bear', 'caT', np.nan, 'lost', 'later', 'tattletale', 'tops', 'taste', 'tart', 'tango', 'taint', 'tarentino', 'tot'] </code> <br>
5) Use pd.str.join() to join all elements in the series <code> [['lion', 'elephant', 'zebra'],
               [1.1, 2.2, 3.3],
               ['cat', 'gerbil', 'dog'],
               ['cow', 4.5, 'goat'],
               ['duck', 'swan', 'fish', 'guppy']] </code> using a hyphen '-' to join.

Solution:

In [19]:
import pandas as pd
import numpy as np

In [21]:
# 1) use pd.str to get a boolean matrix for which words in the series ['Mouse', 'dog', 'house and parrot', '23', np.NaN] contain 'og' - use pd.str.contains

stuff1 = ['Mouse', 'dog', 'house and parrot', '23', np.NaN]

# Pandas Series from list of stuff
stuff_series = pd.Series(stuff1)

# Boolean matrix for which words in the series contain 'og'
stuff_series.str.contains('og')

0    False
1     True
2    False
3    False
4      NaN
dtype: object

In [22]:
# 2) Use pd.str.count to get the count of 'a' in the series ['A', 'B', 'Aaba', 'Baca', np.nan, 'CABA', 'cat','aardvark']

stuff2 = ['A', 'B', 'Aaba', 'Baca', np.nan, 'CABA', 'cat','aardvark']

# Pandas Series from list of stuff
stuff_series = pd.Series(stuff2)

# Count of 'a' in the series
stuff_series.str.count('a')

0    0.0
1    0.0
2    2.0
3    2.0
4    NaN
5    0.0
6    1.0
7    3.0
dtype: float64

In [23]:
# 3) Use pd.str.count to get the count of dollar signs in the series *hint* special characters need a double backslash before them ('\\') ['$', 'B', 'Aab$', '$$ca', 'C$B$', 'cat', 'canna$', 'findme_', 'dollarsign$', 'infinite', 'lo$']

stuff3 = ['$', 'B', 'Aab$', '$$ca', 'C$B$', 'cat', 'canna$', 'findme_', 'dollarsign$', 'infinite', 'lo$']

# Pandas Series from list of stuff
stuff_series = pd.Series(stuff3)

# Count of dollar signs in the series
stuff_series.str.count('\\$')

0     1
1     0
2     1
3     2
4     2
5     0
6     1
7     0
8     1
9     0
10    1
dtype: int64

In [24]:
# 4) Use pd.str.endswith() to see how many strings end with 't' in the series ['bat', 'bear', 'caT', np.nan, 'lost', 'later', 'tattletale', 'tops', 'taste', 'tart', 'tango', 'taint', 'tarentino', 'tot']

stuff4 = ['bat', 'bear', 'caT', np.nan, 'lost', 'later', 'tattletale', 'tops', 'taste', 'tart', 'tango', 'taint', 'tarentino', 'tot']

# Pandas Series from list of stuff
stuff_series = pd.Series(stuff4)

# Boolean matrix for which words in the series end with 't'
stuff_series.str.endswith('t')

0      True
1     False
2     False
3       NaN
4      True
5     False
6     False
7     False
8     False
9      True
10    False
11     True
12    False
13     True
dtype: object

In [25]:
# 5) Use pd.str.join() to join all elements in the series [['lion', 'elephant', 'zebra'], [1.1, 2.2, 3.3], ['cat', 'gerbil', 'dog'], ['cow', 4.5, 'goat'],['duck', 'swan', 'fish', 'guppy']] using a hyphen '-' to join. 

stuff4 = [['lion', 'elephant', 'zebra'],
               [1.1, 2.2, 3.3],
               ['cat', 'gerbil', 'dog'],
               ['cow', 4.5, 'goat'],
               ['duck', 'swan', 'fish', 'guppy']]

# Pandas Series from list of stuff
stuff_series = pd.Series(stuff4)

# Join all elements in the series using a hyphen '-'
stuff_series.str.join('-')

0     lion-elephant-zebra
1                     NaN
2          cat-gerbil-dog
3                     NaN
4    duck-swan-fish-guppy
dtype: object

We can split the data in a series and unpack the results into columns<br>
<br>
<code>
cities = ['PROVIDENCE, Rhode Island', 'Harford, Connecticut','Boston, Massachusetts']
ps = pd.Series(cities).str.split(expand = True)
ps
</code><br>
NOTE: We use the expand key word argument to create the multiple columns

In [48]:
cities = ['PROVIDENCE, Rhode Island', 'Harford, Connecticut','Boston, Massachusetts']
ps = pd.Series(cities).str.split(',', expand = True)
ps

            0               1
0  PROVIDENCE    Rhode Island
1     Harford     Connecticut
2      Boston   Massachusetts

We can remove a row by dropping its index<br>
<br>
<code>
import pandas as pd
favorites = {'1st place':'Pineapple',
            '2nd place': 'Grapes',
            '3rd place': 'Granny Smith Apples',
            '4th place': 'Strawberries'}
ps = pd.Series(favorites.values(), index = favorites.keys())
new_ps = ps.drop(labels='4th place')
new_ps
</code>

In [49]:
import pandas as pd
favorites = {'1st place':'Pineapple',
            '2nd place': 'Grapes',
            '3rd place': 'Granny Smith Apples',
            '4th place': 'Strawberries'}
ps = pd.Series(favorites)
new_ps = ps.drop(labels='4th place')
new_ps

1st place              Pineapple
2nd place                 Grapes
3rd place    Granny Smith Apples
dtype: object

<h4>Pandas Series sum</h4>
We can sum up all of our values in the series<br>
<code>
import pandas as pd
data = [90,93,97,88, 89]
ps = pd.Series(data)
print(ps.sum())
</code>

In [30]:
import pandas as pd
data = [90,93,97,88, 89]
ps = pd.Series(data)
ps.sum()

457

### DataFrame

In [31]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [32]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [ ]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [ ]:
frame.loc[1]

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

In [ ]:
frame = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'area'])
frame['area'] = [5,6,7,8,9,7]
frame

   year   state  pop  area
0  2000    Ohio  1.5     5
1  2001    Ohio  1.7     6
2  2002    Ohio  3.6     7
3  2001  Nevada  2.4     8
4  2002  Nevada  2.9     9
5  2003  Nevada  3.2     7

<h2> Exercise </h2>
1) Edit the states dataframe to create a new dataframe frame2 that adds a 'debt' column   <br> 
2) change the indices to be string numbers from one to six ('one', ... 'six) <br>
3) Print all the values in the years column for viewing <br>
4) Print row 'three' with all it's values using loc[] <br>
5) Use numpy's arange() function to fill the debt column frame2['debt'] with a range of numbers (Hint: you need to match the range to the number of rows in the frame for broadcasting to work).

In [33]:
state_data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
            'year': [2000, 2001, 2002, 2001, 2002, 2003],
            'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [34]:
# 1) Edit the states dataframe to create a new dataframe frame2 that adds a 'debt' column

frame2 = pd.DataFrame(state_data, columns = ['year', 'state', 'pop', 'debt'])

frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [38]:
# 2) change the indices to be string numbers from one to six ('one', ... 'six)

frame2.index = ['one', 'two', 'three', 'four', 'five', 'six']

frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [36]:
# 3) Print all the values in the years column for viewing

frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [39]:
# 4) Print row 'three' with all it's values using loc[]

frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [41]:
# 5) Use numpy's arange() function to fill the debt column frame2['debt'] with a range of numbers (Hint: you need to match the range to the number of rows in the frame for broadcasting to work).

frame2['debt'] = np.arange(6.)

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0